justaneutral/arm-processor-examples/asdk-10.00.00/ti-asdk-bsp/audio_app/am62d/c75/audio_app_c7x.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Dx" --package "ANF" --part "AM62D24-G" --context "c75ss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.20.999+143"}
 */

/**
 * Import the modules used in this configuration.
 */
const i2c         = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1        = i2c.addInstance();
const ipc         = scripting.addModule("/drivers/ipc/ipc");
const mcasp       = scripting.addModule("/drivers/mcasp/mcasp", {}, false);
const mcasp1      = mcasp.addInstance();
const udma        = scripting.addModule("/drivers/udma/udma", {}, false);
const udma1       = udma.addInstance();
const udma2       = udma.addInstance();
const clock       = scripting.addModule("/kernel/dpl/clock");
const debug_log   = scripting.addModule("/kernel/dpl/debug_log");
const mmu_armv8   = scripting.addModule("/kernel/dpl/mmu_armv8", {}, false);
const mmu_armv81  = mmu_armv8.addInstance();
const mmu_armv82  = mmu_armv8.addInstance();
const mmu_armv83  = mmu_armv8.addInstance();
const mmu_armv84  = mmu_armv8.addInstance();
const mmu_armv85  = mmu_armv8.addInstance();
const mmu_armv86  = mmu_armv8.addInstance();
const mmu_armv87  = mmu_armv8.addInstance();
const mmu_armv88  = mmu_armv8.addInstance();
const mmu_armv89  = mmu_armv8.addInstance();
const mmu_armv810 = mmu_armv8.addInstance();
const mmu_armv811 = mmu_armv8.addInstance();
const mmu_armv812 = mmu_armv8.addInstance();
const mmu_armv813 = mmu_armv8.addInstance();
const mmu_armv814 = mmu_armv8.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
i2c1.$name           = "CONFIG_I2C0";
i2c1.I2C.$assign     = "I2C0";
i2c1.I2C_child.$name = "drivers_i2c_v0_i2c_v0_template0";

ipc.enableLinuxIpc = false;
ipc.r5fss0_0       = "NONE";
ipc.a53ss0_0       = "notify";
ipc.mcu_r5fss0_0   = "notify";

mcasp1.$name                                   = "CONFIG_MCASP0";
mcasp1.enableLoopback                          = false;
mcasp1.txDataMask                              = 0xFFFFFFFF;
mcasp1.txActiveSlotMask                        = 0x3;
mcasp1.txCallbackFxn                           = "mcasp_txCallback";
mcasp1.rxCallbackFxn                           = "mcasp_rxCallback";
mcasp1.rxDataMask                              = 0xFFFFFFFF;
mcasp1.clkSyncMode                             = "ASYNC";
mcasp1.RxMode                                  = "TDM";
mcasp1.rxFsWidth                               = 0;
mcasp1.rxBitClkPolarity                        = 0;
mcasp1.rxActiveSlotMask                        = 0x3;
mcasp1.MCASP.$assignAllowConflicts             = "MCASP2";
mcasp1.mcaspSer.create(2);
mcasp1.mcaspSer[0].$name                       = "CONFIG_MCASP_SER0";
mcasp1.mcaspSer[0].MCASP.$assignAllowConflicts = "MCASP2";
mcasp1.mcaspSer[1].$name                       = "CONFIG_MCASP_SER4";
mcasp1.mcaspSer[1].serNum                      = 14;
mcasp1.mcaspSer[1].dataDir                     = "Receive";
mcasp1.mcaspSer[1].MCASP.$assignAllowConflicts = "MCASP2";
scripting.suppress("Resource conflict,MCASP2 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp1.MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP2 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp1.mcaspSer[0].MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP2 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp1.mcaspSer[1].MCASP, "$assign");

udma1.$name        = "CONFIG_UDMA0";
mcasp1.bcDmaDriver = udma1;

udma2.$name         = "CONFIG_UDMA1";
mcasp1.pktDmaDriver = udma2;

debug_log.enableSharedMemLog = true;

mmu_armv81.size  = 0x20000000;
mmu_armv81.$name = "REGISTER_REGION_0";

mmu_armv82.vAddr = 0x20000000;
mmu_armv82.pAddr = 0x20000000;
mmu_armv82.size  = 0x20000000;
mmu_armv82.$name = "REGISTER_REGION_1";

mmu_armv83.vAddr = 0x40000000;
mmu_armv83.pAddr = 0x40000000;
mmu_armv83.size  = 0x20000000;
mmu_armv83.$name = "REGISTER_REGION_2";

mmu_armv84.vAddr = 0x60000000;
mmu_armv84.pAddr = 0x60000000;
mmu_armv84.size  = 0x10000000;
mmu_armv84.$name = "REGISTER_REGION_3";

mmu_armv85.vAddr = 0x7C200000;
mmu_armv85.pAddr = 0x7C200000;
mmu_armv85.$name = "CLEC";
mmu_armv85.size  = 0x100000;

mmu_armv86.$name = "DRU";
mmu_armv86.vAddr = 0x7C400000;
mmu_armv86.pAddr = 0x7C400000;
mmu_armv86.size  = 0x100000;

mmu_armv87.size        = 0x2000000;
mmu_armv87.$name       = "MCASP";
mmu_armv87.vAddr       = 0x2B10000;
mmu_armv87.pAddr       = 0x2B10000;
mmu_armv87.privExecute = false;

mmu_armv88.$name     = "CONFIG_MMU_REGION5_1";
mmu_armv88.vAddr     = 0x99800000;
mmu_armv88.pAddr     = 0x99800000;
mmu_armv88.size      = 0x1000000;
mmu_armv88.attribute = "MAIR4";

mmu_armv89.$name     = "CONFIG_MMU_REGION5_2";
mmu_armv89.vAddr     = 0x9A800000;
mmu_armv89.pAddr     = 0x9A800000;
mmu_armv89.size      = 0x2000000;
mmu_armv89.attribute = "MAIR7";

mmu_armv810.$name     = "L2RAM";
mmu_armv810.vAddr     = 0x7E000000;
mmu_armv810.pAddr     = 0x7E000000;
mmu_armv810.size      = 0x200000;
mmu_armv810.attribute = "MAIR7";

mmu_armv811.$name     = "L2SRAMAUX";
mmu_armv811.vAddr     = 0x7F000000;
mmu_armv811.pAddr     = 0x7F000000;
mmu_armv811.size      = 0x200000;
mmu_armv811.attribute = "MAIR7";

mmu_armv812.size      = 0x300000;
mmu_armv812.$name     = "VRING";
mmu_armv812.attribute = "MAIR4";
mmu_armv812.vAddr     = 0xA0400000;
mmu_armv812.pAddr     = 0xA0400000;

mmu_armv813.$name     = "SHARED_HEAP_MEMORY";
mmu_armv813.vAddr     = 0xA1000000;
mmu_armv813.pAddr     = 0xA1000000;
mmu_armv813.size      = 0x100000;
mmu_armv813.attribute = "MAIR4";

mmu_armv814.$name = "CONFIG_MMU_REGION12";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
i2c1.I2C.SCL.$suggestSolution                    = "I2C0_SCL";
i2c1.I2C.SDA.$suggestSolution                    = "I2C0_SDA";
mcasp1.MCASP.AFSX.$suggestSolution              = "GPMC0_AD12";
mcasp1.MCASP.ACLKX.$suggestSolution             = "GPMC0_AD13";
mcasp1.MCASP.AFSR.$suggestSolution              = "GPMC0_AD14";
mcasp1.MCASP.ACLKR.$suggestSolution             = "GPMC0_AD15";
mcasp1.SYSTEM.$suggestSolution                  = "SYSTEM0";
mcasp1.mcaspSer[0].MCASP.AXR0.$suggestSolution  = "GPMC0_AD8";
mcasp1.mcaspSer[1].MCASP.AXR14.$suggestSolution = "GPMC0_CSn0";
